#include<stdio.h>
#include<math.h>
#define Tw(n) (int)((n)*ceil(log(n)/log(2))-pow(2,ceil(log(n)/log(2)))+1)

#define N 8
int cnt = 0;
void msort(),merge(),show_addr(),show();

void msort(int X[],int n,int Y[]){
	int n1=n/2,n2=n-n1,i;
	int X1[n1],X2[n2],Y1[n1],Y2[n2];
	printf("X1[%d]のアドレス:" ,n1);
	show_addr(X1,n1);
	printf("X2[%d]のアドレス:" ,n2);
	show_addr(X2,n2);
	printf("Y1[%d]のアドレス:" ,n1);
	show_addr(Y1,n1);
	printf("Y2[%d]のアドレス:" ,n2);
	show_addr(Y2,n2);
	for(i=0; i<n1; i++)	X1[i] = X[i];
	for(i=0; i<n2; i++)	X2[i] = X[(n1+i)];
	if(n > 2){
		msort(X1, n1, Y1);
		msort(X2, n2, Y2);
	}else{
		if(n1 > 0)	Y1[0] = X1[0];
		if(n2 > 0)	Y2[0] = X2[0];
	}
	merge(Y1, n1, Y2, n2, Y);
}

void merge(int Y1[], int n1, int Y2[], int n2, int Y[]){
	int i=0, j=0, k=0;
	while(i<n1 && j<n2){
		if(Y1[i] < Y2[j])	Y[k++] = Y1[i++];
		else	Y[k++] = Y2[j++];
		cnt++;
	}
	if(i == n1){
		while(j != n2)	Y[k++] = Y2[j++];
	}
	if(j == n2){
		while(i != n1)	Y[k++] = Y1[i++];
	}
}

void show_addr(int X[], int n){
	int i;
	for(i=0; i<n; i++)	printf("%d " ,&X[i]);
	printf("\n");
}

void show(int X[], int n){
	int i;
	for(i=0; i<n; i++)	printf("%d " ,X[i]);
	printf("\n");
}


int main(){
	int X[N] = {18, 37, 21, 14, 7, 12, 19, 6};
	int Y[N];
	printf("X[%d]のアドレス:" ,N);
	show_addr(X,N);
	printf("Y[%d]のアドレス:" ,N);
	show_addr(Y,N);
	msort(X,N,Y);
	printf("X[%d]:" ,N);
	show(X,N);
	printf("Y[%d]:" ,N);
	show(Y,N);
	printf("cnt=%d : Tw(%d)=%d\n" ,cnt,N,Tw(N));
	
}


/*実行結果
[wxa_rx72@localhost ~]$ ./A4-1.out
X[8]のアドレス:-783752176 -783752172 -783752168 -783752164 -783752160 -783752156 -783752152 -783752148 
Y[8]のアドレス:-783752208 -783752204 -783752200 -783752196 -783752192 -783752188 -783752184 -783752180 
X1[4]のアドレス:-783752384 -783752380 -783752376 -783752372 
X2[4]のアドレス:-783752416 -783752412 -783752408 -783752404 
Y1[4]のアドレス:-783752448 -783752444 -783752440 -783752436 
Y2[4]のアドレス:-783752480 -783752476 -783752472 -783752468 
X1[2]のアドレス:-783752656 -783752652 
X2[2]のアドレス:-783752688 -783752684 
Y1[2]のアドレス:-783752720 -783752716 
Y2[2]のアドレス:-783752752 -783752748 
X1[1]のアドレス:-783752928 
X2[1]のアドレス:-783752960 
Y1[1]のアドレス:-783752992 
Y2[1]のアドレス:-783753024 
X1[1]のアドレス:-783752928 
X2[1]のアドレス:-783752960 
Y1[1]のアドレス:-783752992 
Y2[1]のアドレス:-783753024 
X1[2]のアドレス:-783752656 -783752652 
X2[2]のアドレス:-783752688 -783752684 
Y1[2]のアドレス:-783752720 -783752716 
Y2[2]のアドレス:-783752752 -783752748 
X1[1]のアドレス:-783752928 
X2[1]のアドレス:-783752960 
Y1[1]のアドレス:-783752992 
Y2[1]のアドレス:-783753024 
X1[1]のアドレス:-783752928 
X2[1]のアドレス:-783752960 
Y1[1]のアドレス:-783752992 
Y2[1]のアドレス:-783753024 
X[8]:18 37 21 14 7 12 19 6 
Y[8]:6 7 12 14 18 19 21 37 
cnt=16 : Tw(8)=17
*/